
#+TITLE: Emacs configuration
#+startup: overview
** Todo setup
#+begin_src emacs-lisp :tangle yes

;; Add PROJ as a TODO keyword
(setq org-todo-keywords
      '((sequence "TODO" "PROJ" "IN-PROGRESS" "DONE")))

;; Customize the face for PROJ
(setq org-todo-keyword-faces
      '(("PROJ" . (:foreground "orange" :weight))))
#+end_src

#+RESULTS:
| PROJ | :foreground | orange | :weight |

** setup directories
#+begin_src emacs-lisp :tangle yes
  (setq org-directory "~/notes/" org-roam-directory (file-truename
        (file-name-concat org-directory "roam/")) org-attach-id-dir
        (expand-file-name "assets" org-roam-directory)
        org-roam-dailies-directory "journals/"
        org-roam-file-exclude-regexp "\\.git/.*\\|logseq/.*$")
#+end_src

#+RESULTS:
: \.git/.*\|logseq/.*$
** org tags
#+begin_src emacs-lisp :tangle yes
  (setq org-tag-alist '(
                        ("@skola" . ?s)
                        ("@hem" . ?h)
                        ("@ekonomi" . ?e)
                        ("@system" . ?S)))
#+end_src

#+RESULTS:
: ((@skola . 115) (@hem . 104) (@ekonomi . 101) (@system . 83))

